export const menu =
  "商家1的菜品为: 麻辣小龙虾, 川味回锅肉, 蒜蓉粉丝蒸扇贝, 鲍鱼燕窝汤, 铁板牛肉, 糖醋排骨, 榴莲炒饭, 葱油拌面, 干锅牛蛙, 香辣蟹。商家2的菜品为: 麻婆豆腐, 清蒸鲈鱼, 麻辣香锅, 口水鸡, 酸菜鱼, 酸辣汤, 美式汉堡, 干锅包菜, 蒜蓉蒸扇贝, 蚂蚁上树。商家3的菜品为: 宫保鸡丁, 红烧茄子, 干煸豆角, 美式汉堡, 麻辣火锅, 美式汉堡, 香辣小龙虾, 黑椒牛柳, 醋溜白菜, 酸菜豆腐汤。商家4的菜品为: 美式汉堡, 美式汉堡, 美式汉堡, 美式汉堡, 香菇滑鸡, 醋溜土豆丝, 蚂蚁上树, 菠萝咕咾肉, 麻辣小龙虾面, 美式汉堡。商家5的菜品为: 鱼香肉丝, 干炒牛河, 糖醋鸡块, 美式汉堡, 美式汉堡, 辣子鸡, 麻辣小龙虾面, 干煸四季豆, 红油牛肉面, 美式汉堡。商家6的菜品为: 香辣小龙虾, 干锅包菜, 糖醋虾, 美式汉堡, 美式汉堡, 麻婆豆腐煲, 油焖大虾, 菠萝咕咾肉, 麻辣小龙虾面, 美式汉堡。商家7的菜品为: 香辣小龙虾, 酸辣粉, 蒜蓉蒸扇贝, 干锅牛蛙, 葱爆羊肉, 麻辣小龙虾面, 美式汉堡, 美式汉堡, 蚂蚁上树, 糖醋鱼。商家8的菜品为: 红烧肉, 干煸豆角, 豆花肉丝, 干锅牛蛙, 美式汉堡, 香辣蟹, 麻辣小龙虾面, 爆炒虾仁, 菠萝咕咾肉, 美式汉堡。商家9的菜品为: 美式汉堡, 宫保鸡丁, 西红柿炒蛋, 麻辣小龙虾面, 美式汉堡, 香辣蟹, 红烧乳鸽, 糖醋鲤鱼, 辣子鸡煲, 美式汉堡。商家10的菜品为: 口水鸡, 酸辣汤, 铁板牛肉, 椒盐虾, 红烧鱼头, 红油牛肉面, 红烧鱼尾, 红烧肉, 干锅包菜, 美式汉堡";

export const getMesseageForRecom = (content) => {
  const messages = [
    {
      role: "system",
      content:
        "你将从以下商家和菜单中帮用户选择周一到周五的午餐和晚餐，共十餐。你必须按时间顺序返回这十餐，每餐的格式为 商家名—餐品名，且每餐与每餐之间用|隔开，餐品和商家列表如下" +
        menu,
    },
    {
      role: "user",
      content,
    },
  ];
  return messages;
};
